[
    {
        "name": "Context",
        "type": "app",
        "status": "inprogress",
        "date": "2025-03",
        "tech": ["React", "Node.js", "Jest", "Firebase", "Axios"],
        "description": "A code editor application that allows users to write, compile, and share code seamlessly. Features include version control, user authentication, document sharing, and a compiler supporting multiple programming languages. Built for efficiency and scalability.",
        "link": "https://github.com/4Sharif/Context",
        "image": "images/project-images/context.png"
    },
    {
        "name": "NBA PER Prediction Model",
        "type": "data",
        "status": "complete",
        "date": "2024-11",
        "tech": ["Excel", "Python", "Pandas", "Matplot", "Scikit-learn"],
        "description": "A data mining and machine learning project designed to predict Player Efficiency Ratings (PER) using advanced NBA statistics. Trained on multiple years of data (2014-2024), the model emphasizes predictive accuracy, feature importance analysis, and practical insights for sports analytics.",
        "link": "https://github.com/4Sharif/PER-Prediction-Model",
        "image": "images/project-images/per.png"
    },
    {
        "name": "Digital Manager",
        "type": "app",
        "status": "complete",
        "date": "2024-09",
        "tech": ["Java","Swing","ArrayList","Hashmaps"],
        "description": "A Java-based CRUD application for managing employee records. Built with Swing, this lightweight desktop tool allows users to add, update, delete, and search employee data. Ideal for small businesses and/or teams needing a local management solution.",
        "link": "https://github.com/4Sharif/Digital-Manager", 
        "image": "images/project-images/dm.png"
    },
    {
        "name": "Garden By Deka",
        "type": "website",
        "status": "complete",
        "date": "2025-07",
        "tech": ["HTML", "CSS", "JavaScript"],
        "description": "A four-page gardening blog developed for a TikTok creator, showcasing her work and passion for gardening. Designed with consistent theming, responsive layouts, and interactive elements using HTML, CSS, and JavaScript.",
        "link": "https://github.com/4Sharif/Garden-By-Deka",
        "image": "images/project-images/gbd.png"
    },
    {
        "name": "Guessing Game",
        "type": "game",
        "status": "complete",
        "date": "2024-02",
        "tech": ["C"],
        "description": "A terminal-based C game where players have eight attempts to guess a randomly generated three-digit number. After each guess, the game provides targeted hints on correctness, position accuracy, and relative value, encouraging strategic thinking.",
        "link": "https://github.com/4Sharif/Guessing-Game",
        "image": "images/project-images/gg.png"
    }, 
    {
        "name": "Snake",
        "type": "game",
        "status": "complete",
        "date": "2023-05",
        "tech": ["Python","Tkinter"],
        "description": "A modern Snake game developed in Python with Tkinter. Features a simple GUI, responsive controls, and customizable gameplay, providing a clean and interactive experience.",
        "link": "https://github.com/4Sharif/Snake",
        "image": "images/project-images/snk.png"
    }, 
    {
        "name": "Ping-Pong",
        "type": "game",
        "status": "complete",
        "date": "2023-09",
        "tech": ["HTML","CSS","JavaScript"],
        "description": "A browser-based Ping Pong game built with HTML, CSS, and JavaScript. Includes multiple difficulty levels, customizable colors, adjustable board sizes, and player records. Designed for accessibility and replayability with an engaging interface.",
        "link": "https://github.com/4Sharif/Ping-Pong",
        "image": "images/project-images/pp.png"
    }, 
    {
        "name": "Binder",
        "type": "app",
        "status": "future",
        "date": "2029-01",
        "tech": ["React","TypeScript","Tailwind","Node.js","Azure","Postgres"],
        "description": "A personal media library for managing audio and video content. Users can upload, categorize, and share their curated collections. Will include filtering options and collaborative profile sharing features. Ideal for people that want to access their own digital media in a user-friendly way.",
        "link": "",
        "image": "images/project-images/future.png"
    },
    {
        "name": "Organ",
        "type": "app",
        "status": "future",
        "date": "2029-01",
        "tech": ["Next.js","TypeScript","FastAPI","Postgres","Ollama"],
        "description": "A quick-capture saving tool for storing URLs, text/code snippets, documents, images, and more with keyboard shortcuts. Integrates AI to automatically generate summaries and keyword tags, enabling fast retrieval through a dashboard interface.",
        "link": "",
        "image": "images/project-images/future.png"
    },
    {
        "name": "Craft",
        "type": "app",
        "status": "future",
        "date": "2029-01",
        "tech": ["Next.js","React","Postgres"],
        "description": "An AI-powered interview preparation platform. Simulates realistic interviews with voice-based AI, delivers instant feedback on content quality, tone, and pacing, and provides detailed performance analytics to guide improvement.",
        "link": "",
        "image": "images/project-images/future.png"
    },
    {
        "name": "Panels",
        "type": "app",
        "status": "future",
        "date": "2029-01",
        "tech": ["Tauri","React","Ollama"],
        "description": "An AI-powered virtual assistant designed as a floating desktop overlay. Provides voice and text-based interactions, screen reading, and light system controls such as opening applications or performing quick searches. Built for accessibility and productivity with a minimal, persistent UI.",
        "link": "",
        "image": "images/project-images/future.png"
    },
    {
        "name": "Community Map",
        "type": "app",
        "status": "future",
        "date": "2029-01",
        "tech": ["Next.js","FastAPI","Postgres"],
        "description": "A mobile-friendly application that connects individuals with essential community resources such as food banks, clinics, shelters, and legal aid. Features a ZIP code-based search, interactive map pins, detailed resource information, and more.",
        "link": "",
        "image": "images/project-images/future.png"
    },
    {
        "name": "[Insert] Learn",
        "type": "app",
        "status": "future",
        "date": "2029-01",
        "tech": ["Next.js","Firebase","Postgres","Django"],
        "description": "An interactive course creation and management platform that enables creators to build lessons, quizzes, and daily challenges while providing learners with progress tracking, streaks, and leaderboards. Designed to make online learning engaging, customizable, and scalable.",
        "link": "",
        "image": "images/project-images/future.png"
    },
    {
        "name": "Queue App",
        "type": "app",
        "status": "future",
        "date": "2029-01",
        "tech": ["Django","React","Tailwind","Postgres"],
        "description": "An appointment scheduling application for clinics and service-based businesses. Features include conflict detection, automated reminders, secure client data handling, and role-based access control. Everything will be managed from a dashboard interface.",
        "link": "",
        "image": "images/project-images/future.png"
    },
    {
        "name": "Heatwave Analysis",
        "type": "data",
        "status": "future",
        "date": "2029-01",
        "tech": ["Azure","Postgres","Apache","Spark","Python","Docker","Tableau"],
        "description": "A data-driven project focused on identifying regions most prone to heatwaves using historical temperature datasets. The project emphasizes data engineering by ingesting, cleaning, and transforming large-scale climate data, then enriching it with contextual features such as population density, urban heat islands, and long-term climate trends. The end goal is to produce reproducible pipelines that generate insights into the drivers of extreme heat events and highlight vulnerable regions.",
        "link": "",
        "image": "images/project-images/future.png"
    }
]